Repository: nikhilcherry/GuardRail
Catalog: lib/l10n/app_*.arb
Languages: te

# welcomeMessage
source: Welcome to Guardrail
te: గార్డ్‌రైల్‌కు స్వాగతం

source: Login
te: లాగిన్

source: Sign Up
te: సైన్ అప్

source: Email
te: ఈమెయిల్

source: Password
te: పాస్‌వర్డ్

source: Forgot Password?
te: పాస్‌వర్డ్ మర్చిపోయారా?

# dontHaveAccount
source: Don't have an account?
te: ఖాతా లేదా?

# alreadyHaveAccount
source: Already have an account?
te: ఇప్పటికే ఖాతా ఉందా?

source: Settings
te: సెట్టింగ్‌లు

source: Language
te: భాష

source: Select Language
te: భాషను ఎంచుకోండి

source: English
te: ఆంగ్లం

source: Hindi
te: హిందీ

source: Telugu
te: తెలుగు

source: Biometrics
te: బయోమెట్రిక్స్

source: Notifications
te: నోటిఫికేషన్లు

source: Logout
te: లాగ్ అవుట్

source: Contact Support
te: మద్దతును సంప్రదించండి

source: Role
te: పాత్ర

source: Resident
te: నివాసి

source: Guard
te: గార్డ్

source: Admin
te: అడ్మిన్

source: Name
te: పేరు

source: Phone Number
te: ఫోన్ నంబర్

source: Residence ID
te: నివాస ఐడి

source: Optional
te: ఐచ్ఛికం

source: Gate Control
te: గేట్ నియంత్రణ

source: Visitors Log
te: సందర్శకుల లాగ్

source: Pending Approvals
te: పెండింగ్ ఆమోదాలు

source: History
te: చరిత్ర

source: Approve
te: ఆమోదించండి

source: Reject
te: తిరస్కరించండి

source: Entry Approved
te: ప్రవేశం ఆమోదించబడింది

source: Entry Rejected
te: ప్రవేశం తిరస్కరించబడింది

source: Scan ID
te: ఐడి స్కాన్ చేయండి

source: Enter Details
te: వివరాలను నమోదు చేయండి

source: Visitor Name
te: సందర్శకుని పేరు

source: Purpose
te: ఉద్దేశ్యం

source: Vehicle Number
te: వాహనం నంబర్

source: Add Visitor
te: సందర్శకుని జోడించండి

source: Processing...
te: ప్రాసెస్ చేస్తోంది...

source: Error
te: లోపం

source: Success
te: విజయం

source: Account
te: ఖాతా

source: My Profile
te: నా ప్రొఫైల్

source: Change Password
te: పాస్‌వర్డ్ మార్చండి

# accessAndSecurity
source: Access & Security
te: యాక్సెస్ & భద్రత

source: Visitor Management
te: సందర్శకుల నిర్వహణ

# preApprovalsAndGuests
source: Pre-approvals & Guests
te: ముందస్తు ఆమోదాలు & అతిథులు

source: Preferences
te: ప్రాధాన్యతలు

source: Entry Notifications
te: ప్రవేశ నోటిఫికేషన్లు

source: Alerts for gate requests
te: గేట్ అభ్యర్థనల కోసం హెచ్చరికలు

source: Dark Mode
te: డార్క్ మోడ్

source: System
te: సిస్టమ్

source: Version
te: వెర్షన్

# areYouSureLogout
source: Are you sure you want to log out?
te: మీరు ఖచ్చితంగా లాగ్ అవుట్ చేయాలనుకుంటున్నారా?

source: Cancel
te: రద్దు చేయండి

# fillAllFields
source: Please fill in all fields
te: దయచేసి అన్ని ఫీల్డ్‌లను పూరించండి

# loginFailed
source: Login failed. Please check your credentials.
te: లాగిన్ విఫలమైంది. దయచేసి మీ వివరాలను తనిఖీ చేయండి.

# enterCredentials
source: Please enter your credentials to continue
te: కొనసాగడానికి దయచేసి మీ వివరాలను నమోదు చేయండి

source: Enter password
te: పాస్‌వర్డ్ నమోదు చేయండి

source: Support
te: మద్దతు

# seamlessSecureAccess
source: Seamless, secure access for your community.
te: మీ కమ్యూనిటీ కోసం అతుకులు లేని, సురక్షితమైన యాక్సెస్.

# agreeTerms
source: By proceeding, you agree to our Terms & Privacy Policy.
te: కొనసాగడం ద్వారా, మీరు మా నిబంధనలు & గోప్యతా విధానాన్ని అంగీకరిస్తున్నారు.

source: Resident Portal
te: నివాసి పోర్టల్

source: Good Evening,
te: శుభ సాయంత్రం,

# notificationCenterMessage
source: We are adding a notification center to keep you updated on all activities.
te: అన్ని కార్యకలాపాలపై మిమ్మల్ని అప్‌డేట్‌గా ఉంచడానికి మేము నోటిఫికేషన్ కేంద్రాన్ని జోడిస్తున్నాము.

source: Manage Family
te: కుటుంబాన్ని నిర్వహించండి

source: Manage Flat
te: ఫ్లాట్‌ను నిర్వహించండి

source: New Invite
te: కొత్త ఆహ్వానం

source: Pending Request
te: పెండింగ్ అభ్యర్థన

source: Live
te: లైవ్

source: Visitor approved
te: సందర్శకుడు ఆమోదించబడ్డారు

source: Visitor rejected
te: సందర్శకుడు తిరస్కరించబడ్డారు

source: Recent History
te: ఇటీవలి చరిత్ర

source: No recent visitors
te: ఇటీవలి సందర్శకులు లేరు

source: Wait...
te: వేచి ఉండండి...

source: Arrived
te: వచ్చారు

source: ago
te: క్రితం

source: min
te: నిమి

source: Home
te: హోమ్

source: Visitors
te: సందర్శకులు

source: Guard Checks
te: గార్డ్ తనిఖీలు

source: Recent Activity
te: ఇటీవలి కార్యాచరణ

source: Currently Inside
te: ప్రస్తుతం లోపల

source: No visitors found
te: సందర్శకులు కనుగొనబడలేదు

# registerVisitorMultiline
source: Register Visitor
te: సందర్శకుని నమోదు చేయండి

# scanVisitorQRMultiline
source: Scan Visitor QR
te: సందర్శకుని QR స్కాన్ చేయండి

source: INSIDE
te: లోపల

source: Flat
te: ఫ్లాట్

source: Duration
te: నిడివి

source: Exit
te: నిష్క్రమణ

# markExitTitle
source: Mark Exit?
te: నిష్క్రమణను గుర్తించాలా?

# markExitMessage
source: Mark {name} as exited?
te: {name} బయటకు వెళ్లినట్లు గుర్తించాలా?

source: Confirm
te: నిర్ధారించండి

# markExitAction
source: Mark Exit
te: నిష్క్రమణను గుర్తించండి

source: Admin Panel
te: అడ్మిన్ ప్యానెల్

source: Overview
te: అవలోకనం

source: Dashboard
te: డాష్‌బోర్డ్

source: Total Flats
te: మొత్తం ఫ్లాట్లు

source: Active Guards
te: యాక్టివ్ గార్డ్స్

source: Pending Flats
te: పెండింగ్ ఫ్లాట్లు

source: Analytics (Mock Data)
te: విశ్లేషణలు (మాక్ డేటా)

source: Weekly Visitor Count
te: వారపు సందర్శకుల సంఖ్య

source: Peak Hours
te: పీక్ అవర్స్

source: Guard Status
te: గార్డ్ స్థితి

source: Approval Rates
te: ఆమోదం రేట్లు

source: Recent Guard Checks
te: ఇటీవలి గార్డ్ తనిఖీలు

source: No recent checks
te: ఇటీవలి తనిఖీలు లేవు

source: Location
te: స్థానం

source: Flats
te: ఫ్లాట్లు

source: Guards
te: గార్డ్లు

source: Create Account
te: ఖాతాను సృష్టించండి

source: Sign up to get started
te: ప్రారంభించడానికి సైన్ అప్ చేయండి

source: Full Name
te: పూర్తి పేరు

source: Email Address
te: ఇమెయిల్ చిరునామా

source: Date of Birth
te: పుట్టిన తేది

source: Select Date
te: తేదీని ఎంచుకోండి

source: Confirm Password
te: పాస్‌వర్డ్‌ను నిర్ధారించండి

# createPassword
source: Create a password
te: పాస్‌వర్డ్‌ను సృష్టించండి

source: Confirm your password
te: మీ పాస్‌వర్డ్‌ను నిర్ధారించండి

source: Passwords do not match
te: పాస్‌వర్డ్‌లు సరిపోలలేదు

source: Continue as
te: ఇలా కొనసాగించండి

source: Residence ID (Optional)
te: నివాస ఐడి (ఐచ్ఛికం)

source: Enter Residence ID to join
te: చేరడానికి నివాస ఐడిని నమోదు చేయండి

# leaveEmptyToCreateFlat
source: Leave empty if you want to create a new flat
te: మీరు కొత్త ఫ్లాట్‌ను సృష్టించాలనుకుంటే ఖాళీగా ఉంచండి

# pleaseSelectRole
source: Please select a role to continue
te: కొనసాగడానికి దయచేసి పాత్రను ఎంచుకోండి

# registrationFailed
source: Registration failed. Please try again.
te: నమోదు విఫలమైంది. దయచేసి మళ్లీ ప్రయత్నించండి.

# pleaseConfirmPassword
source: Please confirm your password
te: దయచేసి మీ పాస్‌వర్డ్‌ను నిర్ధారించండి
